app/controllers/puppies_controller.rb

	def index
		@puppies = Puppy.all
---
SELECT "puppies".* FROM "puppies"

	def create
		@puppy = Puppy.create(puppy_params)
---
INSERT INTO "puppies" ("owner", "color", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["owner", "Rachel"], ["color", ""], ["description", ""], ["created_at", "2016-01-05 23:42:29.956613"], ["updated_at", "2016-01-05 23:42:29.956613"]]

	def update
		@puppy.update(puppy_params)
---
UPDATE "puppies" SET "owner" = ?, "description" = ?, "updated_at" = ? WHERE "puppies"."id" = ?  [["owner", "Qiao"], ["description", ""], ["updated_at", "2016-01-06 00:31:40.208211"], ["id", 1]]

	def find_puppy
		@puppy = Puppy.find(params[:id])
---
SELECT  "puppies".* FROM "puppies" WHERE "puppies"."id" = ? LIMIT 1  [["id", 1]]