app/controllers/suggestions_controller.rb

	def create
		@puppy = Puppy.find(params[:puppy_id])
---
SELECT  "puppies".* FROM "puppies" WHERE "puppies"."id" = ? LIMIT 1  [["id", 1]]